# Challenge: "Financial Data Cleaning and Analysis"

### Description:
You are a fintech professional working for a investment firm. Your team has received a large dataset containing financial transactions from various sources, including stocks, bonds, and ETFs. The dataset is messy and requires cleaning before analysis. Your task is to use Pandas to clean and analyze the data to extract valuable insights.

### Task:
- Clean the data by handling missing values and converting data types where necessary.
- Calculate the total value of all transactions for each ticker symbol.
- Calculate the average price per share for each ticker symbol.
- Identify the top 5 tickers with the highest total value of transactions.

Good luck!

In [1]:
import pandas as pd
import numpy as np
import sys

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)
print('Numpy version ' + np.__version__)

Python version 3.11.7 | packaged by Anaconda, Inc. | (main, Dec 15 2023, 18:05:47) [MSC v.1916 64 bit (AMD64)]
Pandas version 2.2.1
Numpy version 1.26.4

### Generate the data  

Column Names and Data Types:  
- **date**
    - Data Type: datetime
    - Description: Date of transaction
- **ticker**
    - Data Type: string
    - Description: Ticker symbol of security
- **type**
    - Data Type: string
    - Description: Type of transaction (buy/sell)
- **quantity**
    - Data Type: int
    - Description: Number of shares/units traded
- **price**
    - Data Type: float
    - Description: Price per share/unit
- **fees**
    - Data Type: float
    - Description: Transaction fees
- **total_value**
    - Data Type: float
    - Description: Total value of transaction value of transaction

In [3]:
# define the number of transactions
num_transactions = 1000

# generate random data
data = {
    'date': pd.date_range('2022-01-01', periods=num_transactions),
    'ticker': np.random.choice(['AAPL', 'GOOG', 'MSFT', 'AMZN', 'FB'], num_transactions),
    'type': np.random.choice(['buy', 'sell'], num_transactions),
    'quantity': np.random.randint(1, 100, num_transactions),
    'price': np.round(np.random.uniform(100, 5000, num_transactions), 2),
    'fees': np.round(np.random.uniform(10, 50, num_transactions), 2)
}

In [4]:
# create the DataFrame
df = pd.DataFrame(data)

# calculate the total_value column
df['total_value'] = df['quantity'] * df['price']

# introduce missing values in the price column (30% missing)
df['price'] = df['price'].apply(lambda x: np.nan if np.random.rand() < 0.3 else x)

df.head(10)

        date ticker  type  quantity    price   fees  total_value
0 2022-01-01   AAPL  sell        81      NaN  10.49    256384.44
1 2022-01-02   GOOG   buy        40  3344.64  45.95    133785.60
2 2022-01-03   AAPL  sell         5  3086.66  46.78     15433.30
3 2022-01-04   AMZN  sell        19  3628.68  42.47     68944.92
4 2022-01-05     FB   buy        24  2359.98  31.41     56639.52
5 2022-01-06   MSFT   buy        41   325.54  22.28     13347.14
6 2022-01-07   GOOG   buy        63  4658.47  46.30    293483.61
7 2022-01-08   AMZN   buy        42  3676.60  29.48    154417.20
8 2022-01-09     FB  sell        83  3023.90  24.78    250983.70
9 2022-01-10   GOOG  sell        18  2796.46  12.22     50336.28

In [5]:
# check data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1000 non-null   datetime64[ns]
 1   ticker       1000 non-null   object
 2   type         1000 non-null   object
 3   quantity     1000 non-null   int32
 4   price        723 non-null    float64
 5   fees         1000 non-null   float64
 6   total_value  1000 non-null   float64
dtypes: datetime64[ns](1), float64(3), int32(1), object(2)
memory usage: 50.9+ KB

Since we have missing values, we can do the calculations by ignoring those rows.

In [6]:
# create group removing rows with missing values
group = df.dropna().groupby('ticker')

# calculate the average price per share for each ticker symbol
g1 = group['price'].mean()
g1 = g1.rename('dropna_price')
g1

ticker
AAPL    2596.966803
AMZN    2731.562197
FB      2658.133158
GOOG    2513.125063
MSFT    2568.949020
Name: dropna_price, dtype: float64

We can also fill the missing values.

- **ffill()** - Fill NA/NaN values by propagating the last valid observation to next valid.

Example:
```
>>> ser = pd.Series([1, np.nan, 2, 3])
>>> ser.ffill()
0   1.0
1   1.0
2   2.0
3   3.0

In [7]:
# create group replacing missing values with last non null value
group = df.ffill().groupby('ticker')

# calculate the average price per share for each ticker symbol
g2 = group['price'].mean()
g2 = g2.rename('ffill_price')
g2

ticker
AAPL    2622.748039
AMZN    2655.890977
FB      2744.863383
GOOG    2489.436029
MSFT    2647.735450
Name: ffill_price, dtype: float64

In [8]:
# combine results to compare
pd.concat([g1,g2], axis=1)

        dropna_price  ffill_price
ticker
AAPL     2596.966803  2622.748039
AMZN     2731.562197  2655.890977
FB       2658.133158  2744.863383
GOOG     2513.125063  2489.436029
MSFT     2568.949020  2647.735450

<p class="text-muted">This tutorial was created by <a href="https://www.hedaro.com" target="_blank"><strong>HEDARO</strong></a></p>